WcfHarness/WcfHarness/RequestXmls/GetRoles.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <GetRoles xmlns="http://www.tavisca.com/Vexiere/IRole/2013/01">
      <getRolesRequest i:type="a:GetOrganizationRolesRQ" xmlns:a="http://schemas.datacontract.org/2004/07/Tavisca.Vexiere.DataContract" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <a:AdditionalData i:nil="true"/>
        <a:PagingInfo>
          <a:PageNumber>1</a:PageNumber>
          <a:PageSize>50</a:PageSize>
        </a:PagingInfo>
        <a:SortingInfo>
          <a:OrderBy i:nil="true"/>
          <a:SortDescending>false</a:SortDescending>
        </a:SortingInfo>
        <a:FilterParameters/>
        <a:OrganizationIdentifier i:type="a:IdBasedOrganizationIdentifier">
          <a:Id>1</a:Id>
        </a:OrganizationIdentifier>
      </getRolesRequest>
    </GetRoles>
  </s:Body>
</s:Envelope>